; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l29_p29_c29_g29_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(crate-at crate23 depot)
	(crate-at crate24 depot)
	(crate-at crate25 depot)
	(crate-at crate26 depot)
	(crate-at crate27 depot)
	(crate-at crate28 depot)
	(crate-at crate29 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(content-crate medicine crate23)
	(content-crate medicine crate24)
	(content-crate medicine crate25)
	(content-crate medicine crate26)
	(content-crate medicine crate27)
	(content-crate medicine crate28)
	(content-crate medicine crate29)
	(person-at person1 loc3)
	(person-at person2 loc28)
	(person-at person3 loc25)
	(person-at person4 loc7)
	(person-at person5 loc20)
	(person-at person6 loc24)
	(person-at person7 loc2)
	(person-at person8 loc27)
	(person-at person9 loc27)
	(person-at person10 loc14)
	(person-at person11 loc22)
	(person-at person12 loc29)
	(person-at person13 loc26)
	(person-at person14 loc23)
	(person-at person15 loc13)
	(person-at person16 loc5)
	(person-at person17 loc4)
	(person-at person18 loc20)
	(person-at person19 loc25)
	(person-at person20 loc27)
	(person-at person21 loc23)
	(person-at person22 loc20)
	(person-at person23 loc6)
	(person-at person24 loc5)
	(person-at person25 loc26)
	(person-at person26 loc26)
	(person-at person27 loc4)
	(person-at person28 loc25)
	(person-at person29 loc10)
	(person-need person1 food)
	(person-need person2 medicine)
	(person-need person3 food)
	(person-need person3 medicine)
	(person-need person4 food)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 food)
	(person-need person7 medicine)
	(person-need person8 food)
	(person-need person8 medicine)
	(person-need person9 food)
	(person-need person10 food)
	(person-need person11 food)
	(person-need person11 medicine)
	(person-need person12 medicine)
	(person-need person15 medicine)
	(person-need person16 medicine)
	(person-need person17 food)
	(person-need person18 food)
	(person-need person19 medicine)
	(person-need person20 food)
	(person-need person22 medicine)
	(person-need person23 food)
	(person-need person23 medicine)
	(person-need person24 medicine)
	(person-need person28 medicine)
	(person-need person29 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person7 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
	(has-content-person person15 medicine)
	(has-content-person person16 medicine)
	(has-content-person person17 food)
	(has-content-person person18 food)
	(has-content-person person19 medicine)
	(has-content-person person20 food)
	(has-content-person person22 medicine)
	(has-content-person person23 food)
	(has-content-person person23 medicine)
	(has-content-person person24 medicine)
	(has-content-person person28 medicine)
	(has-content-person person29 medicine)
))
)

; plan
1. (pick-up-crate crate29 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate29 depot)
   added: (has-crate-drone-arm right crate29)
   goals met: 1 of 30
2. (pick-up-crate crate12 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate12 depot)
   added: (has-crate-drone-arm left crate12)
   goals met: 1 of 30
3. (drone-move depot loc29 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc29)
   goals met: 0 of 30
4. (drop-crate loc29 person12 crate29 right medicine drone1)
   deleted: (has-crate-drone-arm right crate29)
   added: (has-content-person person12 medicine) (empty-arm right)
   goals met: 1 of 30
5. (drone-move loc29 depot drone1)
   deleted: (drone-at drone1 loc29)
   added: (drone-at drone1 depot)
   goals met: 2 of 30
6. (pick-up-crate crate28 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate28 depot)
   added: (has-crate-drone-arm right crate28)
   goals met: 2 of 30
7. (drone-move depot loc28 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc28)
   goals met: 1 of 30
8. (drop-crate loc28 person2 crate28 right medicine drone1)
   deleted: (has-crate-drone-arm right crate28)
   added: (has-content-person person2 medicine) (empty-arm right)
   goals met: 2 of 30
9. (drone-move loc28 depot drone1)
   deleted: (drone-at drone1 loc28)
   added: (drone-at drone1 depot)
   goals met: 3 of 30
10. (pick-up-crate crate27 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate27 depot)
   added: (has-crate-drone-arm right crate27)
   goals met: 3 of 30
11. (drone-move depot loc24 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc24)
   goals met: 2 of 30
12. (drop-crate loc24 person6 crate27 right medicine drone1)
   deleted: (has-crate-drone-arm right crate27)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 3 of 30
13. (drone-move loc24 depot drone1)
   deleted: (drone-at drone1 loc24)
   added: (drone-at drone1 depot)
   goals met: 4 of 30
14. (pick-up-crate crate26 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate26 depot)
   added: (has-crate-drone-arm right crate26)
   goals met: 4 of 30
15. (drone-move depot loc14 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc14)
   goals met: 3 of 30
16. (drop-crate loc14 person10 crate12 left food drone1)
   deleted: (has-crate-drone-arm left crate12)
   added: (has-content-person person10 food) (empty-arm left)
   goals met: 4 of 30
17. (drone-move loc14 depot drone1)
   deleted: (drone-at drone1 loc14)
   added: (drone-at drone1 depot)
   goals met: 5 of 30
18. (pick-up-crate crate11 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate11 depot)
   added: (has-crate-drone-arm left crate11)
   goals met: 5 of 30
19. (drone-move depot loc13 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc13)
   goals met: 4 of 30
20. (drop-crate loc13 person15 crate26 right medicine drone1)
   deleted: (has-crate-drone-arm right crate26)
   added: (has-content-person person15 medicine) (empty-arm right)
   goals met: 5 of 30
21. (drone-move loc13 depot drone1)
   deleted: (drone-at drone1 loc13)
   added: (drone-at drone1 depot)
   goals met: 6 of 30
22. (pick-up-crate crate25 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate25 depot)
   added: (has-crate-drone-arm right crate25)
   goals met: 6 of 30
23. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 5 of 30
24. (drop-crate loc10 person29 crate25 right medicine drone1)
   deleted: (has-crate-drone-arm right crate25)
   added: (has-content-person person29 medicine) (empty-arm right)
   goals met: 6 of 30
25. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 7 of 30
26. (pick-up-crate crate24 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate24 depot)
   added: (has-crate-drone-arm right crate24)
   goals met: 7 of 30
27. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 6 of 30
28. (drop-crate loc4 person17 crate11 left food drone1)
   deleted: (has-crate-drone-arm left crate11)
   added: (has-content-person person17 food) (empty-arm left)
   goals met: 7 of 30
29. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 8 of 30
30. (pick-up-crate crate10 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate10 depot)
   added: (has-crate-drone-arm left crate10)
   goals met: 8 of 30
31. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 7 of 30
32. (drop-crate loc3 person1 crate10 left food drone1)
   deleted: (has-crate-drone-arm left crate10)
   added: (has-content-person person1 food) (empty-arm left)
   goals met: 8 of 30
33. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 9 of 30
34. (pick-up-crate crate9 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate9 depot)
   added: (has-crate-drone-arm left crate9)
   goals met: 9 of 30
35. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 8 of 30
36. (drop-crate loc27 person8 crate9 left food drone1)
   deleted: (has-crate-drone-arm left crate9)
   added: (has-content-person person8 food) (empty-arm left)
   goals met: 9 of 30
37. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 10 of 30
38. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate8 depot)
   added: (has-crate-drone-arm left crate8)
   goals met: 10 of 30
39. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 9 of 30
40. (drop-crate loc27 person8 crate24 right medicine drone1)
   deleted: (has-crate-drone-arm right crate24)
   added: (has-content-person person8 medicine) (empty-arm right)
   goals met: 10 of 30
41. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 11 of 30
42. (pick-up-crate crate23 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate23 depot)
   added: (has-crate-drone-arm right crate23)
   goals met: 11 of 30
43. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 10 of 30
44. (drop-crate loc27 person9 crate8 left food drone1)
   deleted: (has-crate-drone-arm left crate8)
   added: (has-content-person person9 food) (empty-arm left)
   goals met: 11 of 30
45. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 12 of 30
46. (pick-up-crate crate7 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate7 depot)
   added: (has-crate-drone-arm left crate7)
   goals met: 12 of 30
47. (drone-move depot loc27 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc27)
   goals met: 11 of 30
48. (drop-crate loc27 person20 crate7 left food drone1)
   deleted: (has-crate-drone-arm left crate7)
   added: (has-content-person person20 food) (empty-arm left)
   goals met: 12 of 30
49. (drone-move loc27 depot drone1)
   deleted: (drone-at drone1 loc27)
   added: (drone-at drone1 depot)
   goals met: 13 of 30
50. (pick-up-crate crate6 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate6 depot)
   added: (has-crate-drone-arm left crate6)
   goals met: 13 of 30
51. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 12 of 30
52. (drop-crate loc25 person3 crate6 left food drone1)
   deleted: (has-crate-drone-arm left crate6)
   added: (has-content-person person3 food) (empty-arm left)
   goals met: 13 of 30
53. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 14 of 30
54. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate5 depot)
   added: (has-crate-drone-arm left crate5)
   goals met: 14 of 30
55. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 13 of 30
56. (drop-crate loc25 person3 crate23 right medicine drone1)
   deleted: (has-crate-drone-arm right crate23)
   added: (has-content-person person3 medicine) (empty-arm right)
   goals met: 14 of 30
57. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 15 of 30
58. (pick-up-crate crate22 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate22 depot)
   added: (has-crate-drone-arm right crate22)
   goals met: 15 of 30
59. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 14 of 30
60. (drop-crate loc25 person19 crate22 right medicine drone1)
   deleted: (has-crate-drone-arm right crate22)
   added: (has-content-person person19 medicine) (empty-arm right)
   goals met: 15 of 30
61. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 16 of 30
62. (pick-up-crate crate21 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate21 depot)
   added: (has-crate-drone-arm right crate21)
   goals met: 16 of 30
63. (drone-move depot loc25 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc25)
   goals met: 15 of 30
64. (drop-crate loc25 person28 crate21 right medicine drone1)
   deleted: (has-crate-drone-arm right crate21)
   added: (has-content-person person28 medicine) (empty-arm right)
   goals met: 16 of 30
65. (drone-move loc25 depot drone1)
   deleted: (drone-at drone1 loc25)
   added: (drone-at drone1 depot)
   goals met: 17 of 30
66. (pick-up-crate crate20 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate20 depot)
   added: (has-crate-drone-arm right crate20)
   goals met: 17 of 30
67. (drone-move depot loc22 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc22)
   goals met: 16 of 30
68. (drop-crate loc22 person11 crate5 left food drone1)
   deleted: (has-crate-drone-arm left crate5)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 17 of 30
69. (drop-crate loc22 person11 crate20 right medicine drone1)
   deleted: (has-crate-drone-arm right crate20)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 18 of 30
70. (drone-move loc22 depot drone1)
   deleted: (drone-at drone1 loc22)
   added: (drone-at drone1 depot)
   goals met: 19 of 30
71. (pick-up-crate crate19 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate19 depot)
   added: (has-crate-drone-arm right crate19)
   goals met: 19 of 30
72. (pick-up-crate crate4 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate4 depot)
   added: (has-crate-drone-arm left crate4)
   goals met: 19 of 30
73. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 18 of 30
74. (drop-crate loc20 person5 crate19 right medicine drone1)
   deleted: (has-crate-drone-arm right crate19)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 19 of 30
75. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 20 of 30
76. (pick-up-crate crate18 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate18 depot)
   added: (has-crate-drone-arm right crate18)
   goals met: 20 of 30
77. (drone-move depot loc20 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc20)
   goals met: 19 of 30
78. (drop-crate loc20 person18 crate4 left food drone1)
   deleted: (has-crate-drone-arm left crate4)
   added: (has-content-person person18 food) (empty-arm left)
   goals met: 20 of 30
79. (drop-crate loc20 person22 crate18 right medicine drone1)
   deleted: (has-crate-drone-arm right crate18)
   added: (has-content-person person22 medicine) (empty-arm right)
   goals met: 21 of 30
80. (drone-move loc20 depot drone1)
   deleted: (drone-at drone1 loc20)
   added: (drone-at drone1 depot)
   goals met: 22 of 30
81. (pick-up-crate crate17 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate17 depot)
   added: (has-crate-drone-arm right crate17)
   goals met: 22 of 30
82. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 22 of 30
83. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 21 of 30
84. (drop-crate loc7 person4 crate3 left food drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person4 food) (empty-arm left)
   goals met: 22 of 30
85. (drop-crate loc7 person4 crate17 right medicine drone1)
   deleted: (has-crate-drone-arm right crate17)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 23 of 30
86. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 24 of 30
87. (pick-up-crate crate16 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate16 depot)
   added: (has-crate-drone-arm right crate16)
   goals met: 24 of 30
88. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 24 of 30
89. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 23 of 30
90. (drop-crate loc6 person23 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person23 food) (empty-arm left)
   goals met: 24 of 30
91. (drop-crate loc6 person23 crate16 right medicine drone1)
   deleted: (has-crate-drone-arm right crate16)
   added: (has-content-person person23 medicine) (empty-arm right)
   goals met: 25 of 30
92. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 26 of 30
93. (pick-up-crate crate15 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate15 depot)
   added: (has-crate-drone-arm right crate15)
   goals met: 26 of 30
94. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 26 of 30
95. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 25 of 30
96. (drop-crate loc2 person7 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person7 food) (empty-arm left)
   goals met: 26 of 30
97. (drop-crate loc2 person7 crate15 right medicine drone1)
   deleted: (has-crate-drone-arm right crate15)
   added: (has-content-person person7 medicine) (empty-arm right)
   goals met: 27 of 30
98. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 28 of 30
99. (pick-up-crate crate14 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate14 depot)
   added: (has-crate-drone-arm right crate14)
   goals met: 28 of 30
100. (pick-up-crate crate13 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate13 depot)
   added: (has-crate-drone-arm left crate13)
   goals met: 28 of 30
101. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 27 of 30
102. (drop-crate loc5 person16 crate13 left medicine drone1)
   deleted: (has-crate-drone-arm left crate13)
   added: (has-content-person person16 medicine) (empty-arm left)
   goals met: 28 of 30
103. (drop-crate loc5 person24 crate14 right medicine drone1)
   deleted: (has-crate-drone-arm right crate14)
   added: (has-content-person person24 medicine) (empty-arm right)
   goals met: 29 of 30
104. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 30 of 30
